
//<<< Use Configuration Wizard   in Context Menu >>>
// <h> LPCD时间配置
//     <o0.0..3> LPCD检测休眠阶段时间配置（用户根据低功耗要求，可修改） 		
//									<0=>0s
//									<1=>300ms	
//									<2=>400ms 
//									<3=>500ms(Default)
//									<4=>600ms
//									<5=>700ms 
//									<6=>800ms
//									<7=>900ms
//									<8=>1.0s
//									<9=>1.1s
//									<10=>1.2s
//									<11=>1.3s
//								   	<12=>1.4s
//									<13=>1.5s
//									<14=>1.6s
//									<15=>1.7s

//     <o1.0..4> LPCD检测准备阶段时间配置 （根据开发手册，不可修改）		
//									<0=>0ms
//									<1=>0ms
//									<2=>0.4ms
//									<3=>0.5ms
//									<4=>0.6ms 
//									<5=>0.7ms
//									<6=>0.8ms
//									<7=>0.9ms
//									<8=>1.0ms
//									<9=>1.1ms
//									<10=>1.2ms
//								   	<11=>1.3ms
//									<12=>1.4ms
//									<13=>1.5ms(Default)
//									<14=>1.6ms
//									<15=>1.7ms
//									<16=>1.8ms
//									<17=>1.9ms
//									<18=>2.0ms
//									<19=>2.1ms
//									<20=>2.2ms
//									<21=>2.3ms
//									<22=>2.4ms
//									<23=>2.5ms
//									<24=>2.6ms
//									<25=>2.7ms
//									<26=>2.8ms
//									<27=>2.9ms
//									<28=>3.0ms
//									<29=>3.1ms
//									<30=>3.2ms
//									<31=>3.3ms

//     <o2.0..4> LPCD检测阶段时间配置 （用户根据低功耗要求，可修改）
//									<0=>0us
//									<1=>0us
//									<2=>4.7us						
//									<3=>9.4us	
//									<4=>14.1us 
//									<5=>18.8us
//									<6=>23.5us
//									<7=>28.2us 
//									<8=>32.9us
//									<9=>37.6us
//									<10=>42.3us
//									<11=>47us
//									<12=>51.7us(Default)
//									<13=>56.4us
//								   	<14=>61.1us
//									<15=>65.8us
//									<16=>70.5us
//									<17=>75.2us
//									<18=>79.9us
//									<19=>84.6us
//									<20=>89.3us
//									<21=>94us
//									<22=>98.7us
//									<23=>103.4us
//									<24=>108.1us
//									<25=>112.8us
//									<26=>117.5us
//									<27=>122.2us
//									<28=>126.9us
//									<29=>131.6us
//									<30=>136.3us
//									<31=>141us


//     <o3.0..4> VMID准备阶段时间 （根据开发手册，不可修改）		
//									<0=>0ms
//									<1=>0ms
//									<2=>0.4ms
//									<3=>0.5ms
//									<4=>0.6ms 
//									<5=>0.7ms
//									<6=>0.8ms
//									<7=>0.9ms
//									<8=>1.0ms(Default)
//									<9=>1.1ms
//									<10=>1.2ms
//								   	<11=>1.3ms
//									<12=>1.4ms
//									<13=>1.5ms
//									<14=>1.6ms
//									<15=>1.7ms
//									<16=>1.8ms
//									<17=>1.9ms
//									<18=>2.0ms
//									<19=>2.1ms
//									<20=>2.2ms
//									<21=>2.3ms
//									<22=>2.4ms
//									<23=>2.5ms
//									<24=>2.6ms
//									<25=>2.7ms
//									<26=>2.8ms
//									<27=>2.9ms
//									<28=>3.0ms
//									<29=>3.1ms
//									<30=>3.2ms
//									<31=>3.3ms
// </h>

// <h> LPCD发射驱动配置
//     <e4>    LPCD是否使能TX2发射
//	   </e>	 

//     <o5.0..1> LPCD发射NMOS驱动配置
//									<0=>46欧姆
//									<1=>23欧姆(Default)

//     <o6.0..2> LPCD发射PMOS驱动配置
//									<0x0=>180欧姆
//									<0x1=>90欧姆
//									<0x2=>46欧姆
//									<0x3=>23欧姆(Default)
//									<0x4=>12欧姆 
//									<0x5=>6欧姆
//									<0x6=>3欧姆
//									<0x7=>1.5欧姆
// </h>

// <h> LPCD检测参数配置
//     <o7.0..5> LPCD检测脉宽相对灵敏度数 （会在定时调教中微调）		
//									<2=>25% 	
//									<3=>12.5%	
//									<4=>6.25%(Default)
//									<5=>3.125% 

//     <e8> LPCD使能自动唤醒模式 （用户可修改）
//	   </e>

//     <o9.0..2> LPCD配置自动唤醒时间 （用户可修改）
//									<0=>6秒
//									<1=>12秒
//									<2=>15分钟(Default)
//									<3=>30分钟
//									<4=>1小时
//									<5=>1.8小时
//									<6=>3.6小时
//									<7=>7.2小时
//     <o10.0> LPCD自动检测次数，后产生中断 
//									<0=>三次
//									<1=>一次(Default)

//     <e11>    LPCD是否产生中断
//	   </e>

// </h>



#define  	TIMER1_CFG  	  			3			//0
#define  	TIMER2_CFG  	  			13			//1
#define  	TIMER3_CFG  	  			11			//2
#define		VMID_BG_CFG					8			//3
#define  	LPCD_TX2RFEN				1			//4
#define		LPCD_CWN					0x9			//5
#define		LPCD_CWP					0x3			//6
#define		LPCD_THRESHOLD_RATIO		4			//7
#define		AUTO_WUP_EN					0			//8
#define		AUTO_WUP_CFG				1			//9
#define		LPCD_AUTO_DETECT_TIMES		1			//10
#define  	LPCD_IE 					0x01		//11
//<<< end of configuration section >>>

